; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v7 - type_1 ?v4 - type_3)
 	      (pred_2 ?v5 - object ?v4 - type_3)
	      (pred_4 ?v7 - type_1 ?v1 - type_2)
	      (pred_1 ?v7 - type_1 ?v5 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v6 ?v2 - type_3)
       :precondition (and  (pred_3 ?v7 ?v6))
       :effect (and  (pred_3 ?v7 ?v2)
		     (not (pred_3 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v3 ?v8) (pred_3 ?v7 ?v8) (pred_4 ?v7 ?v1))
       :effect (and (pred_1 ?v7 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v8)) 
		    (not (pred_4 ?v7 ?v1))))

   (:action op_3
       :parameters (?v7 - type_1 ?v3 - object ?v8 - type_3 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v7 ?v3 ?v1) (pred_3 ?v7 ?v8))
       :effect (and (pred_2 ?v3 ?v8)
		    (pred_4 ?v7 ?v1)
		    (not (pred_1 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_05 - type_1
obj_09 obj_02 - type_2
obj_04 obj_01 obj_03 - type_3
obj_07 obj_08 obj_06 - object)
(:init
(pred_3 obj_05 obj_04)
(pred_4 obj_05 obj_09)
(pred_4 obj_05 obj_02)
(pred_2 obj_07 obj_01)
(pred_2 obj_08 obj_01)
(pred_2 obj_06 obj_03)
)
(:goal
(and
(pred_2 obj_07 obj_01)
(pred_2 obj_08 obj_03)
(pred_2 obj_06 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_05 ?b obj_09))))
)
)

; plan
1. (op_1 obj_05 obj_04 obj_03)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_03)
   goals met: 1 of 3
2. (op_2 obj_05 obj_06 obj_03 obj_02)
   deleted: (pred_2 obj_06 obj_03) (pred_4 obj_05 obj_02)
   added: (pred_1 obj_05 obj_06 obj_02)
   goals met: 1 of 3
3. (op_1 obj_05 obj_03 obj_04)
   deleted: (pred_3 obj_05 obj_03)
   added: (pred_3 obj_05 obj_04)
   goals met: 1 of 3
4. (op_3 obj_05 obj_06 obj_04 obj_02)
   deleted: (pred_1 obj_05 obj_06 obj_02)
   added: (pred_2 obj_06 obj_04) (pred_4 obj_05 obj_02)
   goals met: 2 of 3
5. (op_1 obj_05 obj_04 obj_03)
   deleted: (pred_3 obj_05 obj_04)
   added: (pred_3 obj_05 obj_03)
   goals met: 2 of 3
6. (op_1 obj_05 obj_03 obj_01)
   deleted: (pred_3 obj_05 obj_03)
   added: (pred_3 obj_05 obj_01)
   goals met: 2 of 3
7. (op_2 obj_05 obj_08 obj_01 obj_02)
   deleted: (pred_2 obj_08 obj_01) (pred_4 obj_05 obj_02)
   added: (pred_1 obj_05 obj_08 obj_02)
   goals met: 2 of 3
8. (op_1 obj_05 obj_01 obj_03)
   deleted: (pred_3 obj_05 obj_01)
   added: (pred_3 obj_05 obj_03)
   goals met: 2 of 3
9. (op_3 obj_05 obj_08 obj_03 obj_02)
   deleted: (pred_1 obj_05 obj_08 obj_02)
   added: (pred_2 obj_08 obj_03) (pred_4 obj_05 obj_02)
   goals met: 3 of 3
